Tekla Open API Reference for Tekla Structures 2025
Operation.CreateBentPlateByFaces Method (Part, IList<Point>, Part, IList<Point>)
 Modifies the first plate by adding a cylindrical bend that connects it to the second plate creating a new BentPlate instance based on two parts and selected faces in each part. See CreateBentPlateByFaces(Part, IList<Point>, Part, IList<Point>, BentPlate.BendShape).
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static BentPlate CreateBentPlateByFaces(
	Part part1,
	IList<Point> face1,
	Part part2,
	IList<Point> face2
)
Public Shared Function CreateBentPlateByFaces (
	part1 As Part,
	face1 As IList(Of Point),
	part2 As Part,
	face2 As IList(Of Point)
) As BentPlate
Parameters
part1
Type: Tekla.Structures.Model.Part
The first part.
face1
Type: System.Collections.Generic.IList<Point>
The selected face on the first part.
part2
Type: Tekla.Structures.Model.Part
The second part.
face2
Type: System.Collections.Generic.IList<Point>
The selected face on the second part.
Return Value
Type: BentPlate
The bent plate object if successful, null otherwise.
See Also
Reference
Operation Class
CreateBentPlateByFaces Overload
Tekla.Structures.Model.Operations Namespace